{
  "restaurants": [
    {
      "id": "6c7bqjgi84kcowlqdz",
      "name": "Bring Your Phone Cafe",
      "description": "Bring Your Phone Cafe is a modern and trendy cafe that welcomes customers to bring their electronic devices and enjoy the free Wi-Fi and charging stations available throughout the space. The cafe offers a delicious selection of coffee and tea drinks, as well as a variety of breakfast and lunch options, including vegan and gluten-free choices. The cafe's vibrant atmosphere is enhanced by local artwork on the walls and a carefully curated music playlist. Whether you're looking for a place to work, catch up with friends, or simply relax with a cup of coffee, Bring Your Phone Cafe is the perfect destination.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/41",
      "city": "Medan",
      "rating": 4.6
    },
    {
      "id": "ljx8i0qu2uckcowlqdz",
      "name": "Run The Gun",
      "description": "Run The Gun is an exciting and innovative restaurant that offers a unique dining experience for food enthusiasts. The restaurant's name comes from a term used in the culinary world, referring to the process of preparing and cooking dishes quickly and efficiently. Run The Gun's menu features a fusion of different cuisines, with a focus on bold and flavorful dishes that are made with fresh and locally-sourced ingredients. The restaurant's modern and industrial decor, combined with its open kitchen concept, creates a lively and dynamic atmosphere that adds to the overall dining experience. Whether you're looking for a quick bite or a full meal, Run The Gun is the perfect destination for foodies who appreciate quality, innovation, and creativity.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/07",
      "city": "Bali",
      "rating": 4.6
    },
    {
      "id": "fe8bbxoazddkcowlqdz",
      "name": "Pangsit Express",
      "description": "Pangsit Express is a cozy and casual restaurant that specializes in Indonesian cuisine, with a particular focus on the famous Indonesian dumplings called Pangsit. The restaurant's menu features a variety of delicious Pangsit dishes, including fried, steamed, and soup-filled dumplings, as well as other Indonesian favorites such as Nasi Goreng and Sate Ayam. The restaurant's warm and welcoming atmosphere, combined with its affordable prices, make it a popular destination for both locals and visitors alike. Whether you're a fan of Indonesian cuisine or simply looking to try something new, Pangsit Express is the perfect place to indulge in flavorful and authentic Indonesian dishes.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/29",
      "city": "Ternate",
      "rating": 4.8
    },
    {
      "id": "ik1zljmlf68kcowlqdz",
      "name": "Ducky Duck",
      "description": "Ducky Duck Sidewalk Restaurant is a charming and unique dining experience that offers a delightful atmosphere for families and children. The restaurant is located on a bustling sidewalk, with plenty of seating options available to enjoy the lively surroundings. The playful decor features a variety of rubber ducks, bright colors, and cartoon-like illustrations, creating a cheerful and welcoming atmosphere. The menu offers a variety of kid-friendly dishes such as chicken tenders, mac and cheese, and burgers, as well as healthier options like salads and grilled chicken. The restaurant also offers a range of fun activities for kids, including coloring sheets and a duck pond where children can pick out a rubber duck to take home. Whether you're looking for a quick bite or a fun family outing, Ducky Duck Sidewalk Restaurant is the perfect destination for kids and adults alike.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/38",
      "city": "Malang",
      "rating": 4.7
    },
    {
      "id": "9jpuzkm6n6jkcowlqdz",
      "name": "Kafein",
      "description": "Kafein Cafe is a chic and cozy coffee shop that offers a unique and inviting atmosphere for coffee enthusiasts. The cafe is situated on a busy sidewalk, providing the perfect spot for people-watching and soaking up the lively ambiance of the city. The menu features a range of specialty coffee drinks, teas, and freshly baked pastries, all made with high-quality ingredients and prepared with meticulous attention to detail. The cafe's stylish decor, combined with comfortable seating and a relaxed vibe, creates a welcoming space for customers to catch up with friends, work remotely, or simply enjoy a quiet moment with a cup of coffee. Whether you're a coffee connoisseur or just looking for a cozy spot to unwind, Kafein Cafe is the perfect destination for coffee lovers.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/40",
      "city": "Bali",
      "rating": 3.8
    },
    {
      "id": "cpl5jpsnuqkkcowlqdz",
      "name": "Makan mudah",
      "description": "Makan Mudah is a luxurious and sophisticated fine-dining restaurant that offers an exceptional culinary experience for discerning foodies. The restaurant's elegant decor, combined with impeccable service, creates a refined and intimate ambiance that is perfect for special occasions or romantic dinners. The menu features a range of expertly crafted dishes that showcase the finest ingredients and flavors of Southeast Asia, with a particular focus on Indonesian cuisine. From succulent grilled meats to delicate seafood dishes and decadent desserts, each dish is a masterpiece of culinary artistry. Whether you're celebrating a special occasion or simply looking for an unforgettable dining experience, Makan Mudah fine-dining restaurant is the perfect destination for food lovers.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/08",
      "city": "Malang",
      "rating": 4.6
    },
    {
      "id": "iqtf9hmdzvbkcowlqdz",
      "name": "Saya Suka",
      "description": "Saya Suka is a charming and cozy dining destination that offers a warm and welcoming atmosphere for customers. The restaurant's decor features a beautiful blend of classic and modern elements, with warm wood paneling and vintage-inspired accents creating a timeless and elegant ambiance. The menu features a range of classic dishes, all made with fresh and high-quality ingredients and prepared with care. From hearty steaks and seafood to flavorful pasta dishes and salads, there is something for everyone at Saya Suka classic woody restaurant. Whether you're looking for a romantic dinner for two or a cozy family outing, Saya Suka restaurant is the perfect destination for anyone who loves great food and a relaxed atmosphere.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/32",
      "city": "Surabaya",
      "rating": 3.6
    },
    {
      "id": "8i06gqcc2dpkcowlqdz",
      "name": "Gigitan Cepat",
      "description": "Gigitan Cepat is a humble food restaurant that prides itself on serving delicious, affordable meals. The restaurant's cozy atmosphere and friendly staff make it a great spot for a quick bite with friends or family. Gigitan Cepat's menu offers a variety of tasty options, including classic Indonesian dishes like nasi goreng and mie goreng, as well as burgers and fries for those looking for a Western twist. The portions are generous, ensuring that customers leave satisfied without breaking the bank. Overall, Gigitan Cepat is a must-visit for anyone looking for a delicious meal in a casual setting.",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/45",
      "city": "Aceh",
      "rating": 4.0
    },
    {
      "id": "wf5o19xhxxkcowlqdz",
      "name": "Fairy Cafe",
      "description": "Fairy Cafe is a cozy and charming coffee shop, perfect for a relaxing break in your day. As soon as you step inside, you are transported to a different era with its vintage decor and soft lighting. The menu offers a variety of coffee drinks, both hot and cold, as well as pastries and sandwiches. The coffee is expertly brewed from freshly roasted beans and has a rich and bold flavor. The atmosphere is friendly and welcoming, with comfortable seating and background music playing from a vintage record player. Whether you are looking for a quick caffeine fix or a place to unwind with friends, Fairy Cafe is the perfect spot.    ",
      "pictureId": "https://restaurant-api.dicoding.dev/images/medium/04",
      "city": "Malang",
      "rating": 3.9
    },
    {
      "id": "ab5o19xhxxkcowlqdz",
      "name": "Fresh Air",
      "description" : "Fresh Air is a minimalist cafe that has been designed with simplicity and elegance in mind. The cafe has an open, airy feel that is perfect for relaxing and enjoying a cup of coffee with friends or colleagues. The interior decor is clean and modern, with a neutral color palette that makes the space feel spacious. A variety of seating options are available, from comfortable armchairs to sleek bar stools, so there is something for everyone. The menu at Fresh Air is also simple, with a focus on high-quality, locally sourced ingredients. Guests can enjoy a delicious cup of coffee or tea, along with a range of pastries, sandwiches, and salads. Overall, Fresh Air is the perfect place to unwind and enjoy a peaceful, minimalist atmosphere.",
      "pictureId": "./images/resto/fresh-air_cafe.jpg",
      "city": "Surabaya",
      "rating": 4.5
    },
    {
      "id": "wf6U19xhxxkcowlqdz",
      "name": "Big Chunk",
      "description" : "Big Chunk is a family restaurant that offers a wide variety of hearty dishes for you to enjoy. The restaurant has a cozy and welcoming atmosphere, making it a perfect spot for a family dinner or a casual night out with friends. The menu includes classic American dishes such as burgers, fries, and sandwiches, as well as some international flavors like tacos, pasta, and stir-fry. The portions are generous and the prices are affordable, making it a great dining option for families on a budget. The staff at Big Chunk is friendly and attentive, and they will make sure that you have a pleasant dining experience. Overall, Big Chunk is a great spot to enjoy delicious comfort food in a warm and inviting setting.",
      "pictureId": "./images/resto/big-chunk_resto.jpg",
      "city": "Banjarnegara",
      "rating": 4.2
    },
    {
      "id": "wf5o19xhyykcowlqdz",
      "name": "Dimsum Enak",
      "description" : "Dimsum Enak is a Chinese restaurant known for its delicious dimsum dishes. The restaurant is decorated with traditional Chinese elements that create a cozy and welcoming atmosphere for diners. From the steaming baskets of pork buns to the savory shrimp dumplings, Dimsum Enak offers a wide variety of dimsum options that are sure to satisfy any craving. The menu also includes other classic Chinese dishes such as fried rice, chow mein, and hot and sour soup. The restaurant is famous for its friendly and attentive service, which adds to the overall dining experience. For those who want to experience a taste of China, Dimsum Enak is definitely worth a visit.",
      "pictureId": "./images/resto/dimsum-enak_resto.jpg",
      "city": "Malang",
      "rating": 4.8
    }
  ]
}
